In [1]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
import numpy as np 
import pandas as pd

# 데이타프레임 조회 

- 컬럼 조회 
- 행 조회 
- 컬럼+행 조회 

```
데이타프레임[컬럼명]
데이타프레임[[컬럼명1, 컬럼명2, 컬럼명3 ....]]

데이타프레임.컬럼명 

loc : location 행이름, 컬럼명 
데이타프레임.loc[행이름]
데이타프레임.loc[start:end]
데이타프레임.loc[start:end, start:end]


iloc : index location 행인덱스, 컬럼인덱스
데이타프레임.iloc[행인덱스]
데이타프레임.iloc[start:end]
데이타프레임.iloc[start:end, start:end]

행 조회 
데이타프레임[행인덱스]
데이타프레임[start:end]


```

In [4]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df1 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])
df1

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [5]:
df1.columns

Index(['name', 'year', 'points', 'penalty'], dtype='object')

In [6]:
df1.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

##### [] 를 이용한 컬럼조회

In [7]:
# 특정 1개의 컬럼 조회 => 시리즈 
# 데이타프레임[컬럼명]
df1['name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [8]:
type(df1['name'])

pandas.core.series.Series

In [9]:
# 특정 1개의 컬럼 조회 => 데이타프레임
# 데이타프레임[[컬럼명]]
df1[['name']]

          name
one      Haidi
two      Haidi
three    Haidi
four   Charles
five   Charles

In [10]:
type(df1[['name']])

pandas.core.frame.DataFrame

In [12]:
# KeyError 
# df1[0]

In [13]:
# 다수개의 컬럼 조회 => 데이타프레임
# 데이타프레임[[컬럼명1, 컬럼명2 ...]]

In [16]:
df1[['year', 'name', 'points']]

       year     name  points
one    2014    Haidi     1.5
two    2015    Haidi     1.7
three  2016    Haidi     3.6
four   2015  Charles     2.5
five   2017  Charles     2.9

In [14]:
df1

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [19]:
# 에러 발생 : 슬라이싱 x
# df1[['name':'year']]

#####  도트(.) 를 이용한 특정 컬럼 조회  => 시리즈

In [21]:
df1.name

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

##### loc 방식으로 컬럼 조회 

- 데이타프레임.loc[:, 컬럼명] => 시리즈 
- 데이타프레임.loc[:, 컬럼명1:컬럼명2] => 데이타프레임

In [22]:
df1.loc[:, 'name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [23]:
# 컬럼명을 이용한 슬라이싱 
df1.loc[:, 'name':'points']

          name  year  points
one      Haidi  2014     1.5
two      Haidi  2015     1.7
three    Haidi  2016     3.6
four   Charles  2015     2.5
five   Charles  2017     2.9

##### iloc 방식으로 컬럼 조회  : 위치인덱스 숫자 이용

- 데이타프레임.iloc[:, 컬럼인덱스] => 시리즈 
- 데이타프레임.iloc[:, 컬럼인덱스1:컬럼인덱스2] => 데이타프레임

In [26]:
# 특정 컬럼 1개 
df1.iloc[:, 0]

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [29]:
# 연속 컬럼 슬라이싱 => 데이타프레임
df1.iloc[:, 0:2]

          name  year
one      Haidi  2014
two      Haidi  2015
three    Haidi  2016
four   Charles  2015
five   Charles  2017

##### loc 방식으로 행 조회 
- 데이타프레임.loc[인덱스명] => 시리즈 
- 데이타프레임.loc[[인덱스명]] => 데이타프레임
- 데이타프레임.loc[인덱스명, :] => 시리즈 
- 데이타프레임.loc[인덱스명1:인덱스명2, :] => 데이타프레임
- 데이타프레임.loc[[인덱스명1, 인덱스명2 ...], :] => 데이타프레임

In [32]:
# 특정행 조회 => 시리즈 
df1.loc['three']

name       Haidi
year        2016
points       3.6
penalty        3
Name: three, dtype: object

In [34]:
df1.loc['three', :]

name       Haidi
year        2016
points       3.6
penalty        3
Name: three, dtype: object

In [33]:
# 특정행 조회 => 데이타프레임 
df1.loc[['three']]

        name  year  points  penalty
three  Haidi  2016     3.6        3

In [35]:
# 불연속인 행 조회 - two, five
df1.loc[['two', 'five']]

         name  year  points  penalty
two     Haidi  2015     1.7        2
five  Charles  2017     2.9        5

In [36]:
# 연속적인 행 조회 => 데이타프레임 슬라이싱 
df1.loc['two':'four']

          name  year  points  penalty
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4

##### iloc 방식으로 행 조회  : 위치인덱스 숫자 이용

- 데이타프레임.iloc[행인덱스] => 시리즈 
- 데이타프레임.iloc[행인덱스1:행인덱스2] => 데이타프레임

In [37]:
# 마지막 행 
df1.iloc[-1]

name       Charles
year          2017
points         2.9
penalty          5
Name: five, dtype: object

In [42]:
# 슬라이싱
df1.iloc[1:4]

          name  year  points  penalty
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4

In [43]:
# 불연속인 행 조회 
df1.iloc[[0, 2, -1]]

          name  year  points  penalty
one      Haidi  2014     1.5        1
three    Haidi  2016     3.6        3
five   Charles  2017     2.9        5

In [53]:
# 특정행의 특정열 조회 : 슬라이싱
# 데이타프레임명.iloc[start1:end1, start2:end2]
# 데이타프레임명.loc[인덱스명1:인덱스명2, 컬럼명1:컬럼명2]

# 특정행의 특정열의 값 
# 데이타프레임명.iloc[행인덱스, 열인덱스]
# 데이타프레임명.loc[행이름, 열이름]

In [50]:
df1.loc['two':'three', 'name':'year']

        name  year
two    Haidi  2015
three  Haidi  2016

In [52]:
df1.iloc[1:3, 0:2]

        name  year
two    Haidi  2015
three  Haidi  2016

In [55]:
df1.iloc[0, 2], df1.loc['one', 'points']

(1.5, 1.5)

In [56]:
# 맨 앞의 특정행의 갯수 조회 - 데이타프레임명.head(n)
# 맨뒤의 특정행의 갯수 조회 - 데이타프레임명.tail(n)
# n은 기본값 5 

# 무작위 특정행의 갯수 조회 - 데이타프레임명.sample(n)
# n 은 기본값1

In [57]:
data = np.random.randint(1,300,100).reshape(-1,5)
df2 = pd.DataFrame(data)

In [60]:
df2.shape

(20, 5)

In [61]:
df2.head(2)

    0    1    2    3    4
0  44  213  257   29  146
1  72  275  124  269  184

In [62]:
df2.tail(3)

      0    1    2    3    4
17  163   17  197   55  122
18   90   66  269  105   26
19   92  175  251  298    7

In [63]:
df2.sample()

      0   1    2   3   4
12  221  23  209  50  90

In [64]:
df2.sample(3)

      0    1    2    3    4
0    44  213  257   29  146
15  137  147  214  217   56
11    7  177  230  195   27

In [59]:
df2

      0    1    2    3    4
0    44  213  257   29  146
1    72  275  124  269  184
2   154  266  267  271  181
3    14  186  174  223  195
4   142  129   29  164  224
5    73   27  217   65  235
6   186  147  125  275  108
7    10  111  151   39  167
8   176  177  176  189  164
9   184  249   87   64  182
10  248  132  139   80  161
11    7  177  230  195   27
12  221   23  209   50   90
13   36  104  119  240  189
14   57  239  131  130   30
15  137  147  214  217   56
16  179  257  216  176  233
17  163   17  197   55  122
18   90   66  269  105   26
19   92  175  251  298    7

# 행단위 열단위로 데이타 추가

- 컬럼추가 
```
데이타프레임[새로운컬럼명] = 리스트/넘파이배열/range()/기존컬럼을이용한계산식  
```

- 행추가 
```
데이타프레임.loc[새로운행명] = 리스트/넘파이배열/range()
```

In [68]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df3 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])
df3

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [69]:
# 컬럼 추가 
df3['id'] = 10
df3

          name  year  points  penalty  id
one      Haidi  2014     1.5        1  10
two      Haidi  2015     1.7        2  10
three    Haidi  2016     3.6        3  10
four   Charles  2015     2.5        4  10
five   Charles  2017     2.9        5  10

In [71]:
# 길이 유의 
df3['addr'] = ['LA', 'LA', 'LA', 'Hawaii', 'WC', ]
df3

          name  year  points  penalty  id    addr
one      Haidi  2014     1.5        1  10      LA
two      Haidi  2015     1.7        2  10      LA
three    Haidi  2016     3.6        3  10      LA
four   Charles  2015     2.5        4  10  Hawaii
five   Charles  2017     2.9        5  10      WC

In [74]:
# 기존 컬럼과 계산식 이용 
df3['bonus'] = df3['points']*100
df3

          name  year  points  penalty  id    addr  bonus
one      Haidi  2014     1.5        1  10      LA  150.0
two      Haidi  2015     1.7        2  10      LA  170.0
three    Haidi  2016     3.6        3  10      LA  360.0
four   Charles  2015     2.5        4  10  Hawaii  250.0
five   Charles  2017     2.9        5  10      WC  290.0

In [75]:
# 행추가 
df3.loc['six'] = ['Charles', 2017, 3.3, 6, 30, 'WC', 290.0]
df3

          name  year  points  penalty  id    addr  bonus
one      Haidi  2014     1.5        1  10      LA  150.0
two      Haidi  2015     1.7        2  10      LA  170.0
three    Haidi  2016     3.6        3  10      LA  360.0
four   Charles  2015     2.5        4  10  Hawaii  250.0
five   Charles  2017     2.9        5  10      WC  290.0
six    Charles  2017     3.3        6  30      WC  290.0

In [77]:
df3.dtypes

name        object
year         int64
points     float64
penalty      int64
id           int64
addr        object
bonus      float64
dtype: object

In [78]:
# ValueError - 길이 주의 
df3.loc['seven'] = [True, 2017, 3.3, 6, 30, 'WC', 290.0]
df3

          name  year  points  penalty  id    addr  bonus
one      Haidi  2014     1.5        1  10      LA  150.0
two      Haidi  2015     1.7        2  10      LA  170.0
three    Haidi  2016     3.6        3  10      LA  360.0
four   Charles  2015     2.5        4  10  Hawaii  250.0
five   Charles  2017     2.9        5  10      WC  290.0
six    Charles  2017     3.3        6  30      WC  290.0
seven     True  2017     3.3        6  30      WC  290.0

In [79]:
# 자료형 테스트 
df3.loc['eight'] = ['Haidi', '2020년', 3.3, 6, 30, 'WC', 290.0]
df3

          name   year  points  penalty  id    addr  bonus
one      Haidi   2014     1.5        1  10      LA  150.0
two      Haidi   2015     1.7        2  10      LA  170.0
three    Haidi   2016     3.6        3  10      LA  360.0
four   Charles   2015     2.5        4  10  Hawaii  250.0
five   Charles   2017     2.9        5  10      WC  290.0
six    Charles   2017     3.3        6  30      WC  290.0
seven     True   2017     3.3        6  30      WC  290.0
eight    Haidi  2020년     3.3        6  30      WC  290.0

In [80]:
df3.dtypes

name        object
year        object
points     float64
penalty      int64
id           int64
addr        object
bonus      float64
dtype: object

In [84]:
# 테스트 : iloc 로 행 삽입이 가능할까?
# IndexError => x
# df3.iloc[8] = ['Haidi', '2020년', 3.3, 6, 30, 'WC', 290.0]
# df3

In [81]:
df3.shape

(8, 7)

# 기존 값 수정하기 

```
데이타프레임.loc[행명, 열명] = 새로운값
데이타프레임.iloc[행인덱스, 열인덱스] = 새로운값


```

In [87]:
df3.loc['one', 'name'] = 'Julia'

In [90]:
df3.iloc[-1, -1] = 500

In [92]:
# 슬라이싱한 상태에서 값 교체 
df3.loc['one':'three', 'penalty'] = -500

In [96]:
df3.shape

(8, 7)

In [100]:
df3.shape[0]

8

In [111]:
np.arange(0, df3.shape[0])

array([0, 1, 2, 3, 4, 5, 6, 7])

In [103]:
np.arange(0, df3.shape[0])

array([0, 1, 2, 3, 4, 5, 6, 7])

In [114]:
# 특정 컬럼 전체의 값 교체 
df3['id'] = np.arange(1, df3.shape[0]+1)*10

In [115]:
df3

          name   year  points  penalty  id    addr  bonus
one      Julia   2014     1.5     -500  10      LA  150.0
two      Haidi   2015     1.7     -500  20      LA  170.0
three    Haidi   2016     3.6     -500  30      LA  360.0
four   Charles   2015     2.5        4  40  Hawaii  250.0
five   Charles   2017     2.9        5  50      WC  290.0
six    Charles   2017     3.3        6  60      WC  290.0
seven     True   2017     3.3        6  70      WC  290.0
eight    Haidi  2020년     3.3        6  80      WC  500.0

In [86]:
df3

          name   year  points  penalty  id    addr  bonus
one      Haidi   2014     1.5        1  10      LA  150.0
two      Haidi   2015     1.7        2  10      LA  170.0
three    Haidi   2016     3.6        3  10      LA  360.0
four   Charles   2015     2.5        4  10  Hawaii  250.0
five   Charles   2017     2.9        5  10      WC  290.0
six    Charles   2017     3.3        6  30      WC  290.0
seven     True   2017     3.3        6  30      WC  290.0
eight    Haidi  2020년     3.3        6  30      WC  290.0

# 행과 열 삭제 

- 열삭제 1
inplace=True 를 지정하면 원본에 바로 적용 
```
데이타프레임명.drop(컬럼명, axis=1, inplace=True)
데이타프레임명.drop([컬럼명1, 컬럼명2 ... ], axis=1, inplace=True)
```

- 열삭제 2
<br> del 데이타프레임명[컬럼명]

- 행삭제 
inplace=True 를 지정하면 원본에 바로 적용 
```
데이타프레임명.drop(행명, axis=0, inplace=True)

데이타프레임명.drop([행명1, 행명2 ... ], axis=0, inplace=True)
```

In [119]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df4 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])

In [120]:
df4

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [121]:
del df4['penalty']

In [122]:
df4

          name  year  points
one      Haidi  2014     1.5
two      Haidi  2015     1.7
three    Haidi  2016     3.6
four   Charles  2015     2.5
five   Charles  2017     2.9

In [126]:
# inplace=True 원본에서도 삭제 
df4.drop('year', axis=1, inplace=True)

In [128]:
# 삭제할 컬럼이 여러개인 경우 리스트로 삽입 
df4.drop(['name','points'], axis=1)

Empty DataFrame
Columns: []
Index: [one, two, three, four, five]

In [129]:
df4

          name  points
one      Haidi     1.5
two      Haidi     1.7
three    Haidi     3.6
four   Charles     2.5
five   Charles     2.9

In [133]:
# df4.drop(['one'], axis=0)
# axis=0 은 생략 가능 
df4.drop(['one'], inplace=True)

In [134]:
df4

          name  points
two      Haidi     1.7
three    Haidi     3.6
four   Charles     2.5
five   Charles     2.9

In [135]:
df4.drop(['two', 'five'])

          name  points
three    Haidi     3.6
four   Charles     2.5

# 데이타프레임의 복사 

- 깊은 복사 VS 얕은 복사 
- 얕은 복사란?
: 복사본이나 원본이 같은 메모리번지 사용. <br>
: 서로 데이타가 연결  <br> <br>
- 깊은 복사란?
: 복사본이나 원본이 서로 다른 메모리번지 사용.  <br>
: copy() 메서드 이용

In [151]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df5 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])

In [152]:
df5

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [153]:
# 얕은 복사 방식으로 복제본 생성 
df6 = df5

In [154]:
df6

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [155]:
# 복제본에서 값 수정 
df6.loc['one', 'name'] = '홍길동'
df6

          name  year  points  penalty
one        홍길동  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [156]:
# 원본도 값이 같이 수정된다. 
df5

          name  year  points  penalty
one        홍길동  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [157]:
df5.loc['one', 'points'] = 5.5
df5

          name  year  points  penalty
one        홍길동  2014     5.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [158]:
df6

          name  year  points  penalty
one        홍길동  2014     5.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [159]:
# 깊은 복사 방식으로 복사본  생성 
df7 = df5.copy()
df7

          name  year  points  penalty
one        홍길동  2014     5.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [161]:
df7.iloc[-1, -1] = 500
df7

          name  year  points  penalty
one        홍길동  2014     5.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9      500

In [163]:
# 원본은 변경 없음 
df5

          name  year  points  penalty
one        홍길동  2014     5.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

# 조건식에 필터링 => 불린 인덱싱 

```
데이타프레임[조건절] 
>=, <=, ==, != 
&, |, ~
```

In [165]:
data = { "year":[2014, 2015, 2016, 2015, 2017,2013]
        ,"name":['Haidi', 'Haidi', 'Haidi', 'Charles', 'Charles', 'Hayoung']
        , "points":[1.5, 1.7, 3.6, 2.5, 2.9, 4.0]
        , "penalty":[0.1,0.2, 0.3,0.4,0.5,0.1 ]
        , "net_points":[1.4,1.5,3.3,2.1,2.4,2.1]
        , "bonus":[10,20,30,40,50,60]}
df = pd.DataFrame(data, columns=["year","name","points","penalty","net_points","bonus"],
                    index=["one", "two", "three", "four", "five","six"])

In [167]:
df

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

In [168]:
# name 값이 Haidi 데이타 조회 
df['name'] == 'Haidi'

one       True
two       True
three     True
four     False
five     False
six      False
Name: name, dtype: bool

In [169]:
df[df['name'] == 'Haidi']

       year   name  points  penalty  net_points  bonus
one    2014  Haidi     1.5      0.1         1.4     10
two    2015  Haidi     1.7      0.2         1.5     20
three  2016  Haidi     3.6      0.3         3.3     30

In [171]:
# penalty 값이 0.3 이상 
df['penalty'] >= 0.3

one      False
two      False
three     True
four      True
five      True
six      False
Name: penalty, dtype: bool

In [172]:
df[df['penalty'] >= 0.3]

       year     name  points  penalty  net_points  bonus
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50

In [173]:
# penalty 값이 0.3 이상 , name 값은 'Charles'
(df['penalty'] >= 0.3) & (df['name'] =='Charles')

one      False
two      False
three    False
four      True
five      True
six      False
dtype: bool

In [174]:
df[(df['penalty'] >= 0.3) & (df['name'] =='Charles')]

      year     name  points  penalty  net_points  bonus
four  2015  Charles     2.5      0.4         2.1     40
five  2017  Charles     2.9      0.5         2.4     50

In [170]:
df

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

# csv, tsv 파일 => 데이타프레임 

```
pd.read_csv('파일경로', encoding='cp949')
```

예제 소스 확인 
- data 폴더 

population_in_Inchon.csv
gapminder.tsv

In [175]:
ls data

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 2819-FF50

 C:\workspace211123\data 디렉터리

2021-11-25  오후 04:25    <DIR>          .
2021-11-25  오후 04:25    <DIR>          ..
2021-11-23  오전 12:12             3,088 births.txt
2020-08-12  오후 10:28            83,637 gapminder.tsv
2021-11-23  오전 12:25            35,455 Jeju2021.csv
2016-07-17  오후 09:46           171,308 movies.dat
2019-08-03  오후 04:36               528 population_in_Inchon.csv
2018-04-24  오전 10:42        24,594,131 ratings.dat
2019-03-20  오전 10:54         1,185,149 seoul.csv
2021-01-31  오후 08:49            93,805 seoul2021.csv
               8개 파일          26,167,101 바이트
               2개 디렉터리  70,075,596,800 바이트 남음

In [178]:
pd.read_csv?

In [180]:
df_inchon = pd.read_csv('data/population_in_Inchon.csv', encoding='cp949')

In [181]:
df_inchon

    군  구  주 민 등 록 인 구(남)  주 민 등 록 인 구(여)  주 민 등 록 인 구(세대수)  외 국 인(남)  외 국 인(여)
0  중   구           62202           57227             55952      2006      1886
1  동   구           33875           33312             29153       518       391
2  남   구          211021          207512            183418      4281      4235
3    연수구          169121          170806            126408      4386      4862
4    남동구          268451          270525            217621      8370      3824
5    부평구          262855          266867            213270      6602      6178
6    계양구          157731          158190            124349      1396      1775
7  서   구          269966          264198            208064      8331      3793
8    강화군           34498           34274             32202       495       278
9    옹진군           12010            9200             11746       130        54

In [182]:
df_inchon.shape

(10, 6)

In [183]:
df_inchon.columns

Index(['군  구', '주 민 등 록 인 구(남)', '주 민 등 록 인 구(여)', '주 민 등 록 인 구(세대수)',
       '외 국 인(남)', '외 국 인(여)'],
      dtype='object')

In [184]:
# '군  구', '주 민 등 록 인 구(세대수)' 컬럼 출력 
df_inchon[['군  구', '주 민 등 록 인 구(세대수)']]

    군  구  주 민 등 록 인 구(세대수)
0  중   구             55952
1  동   구             29153
2  남   구            183418
3    연수구            126408
4    남동구            217621
5    부평구            213270
6    계양구            124349
7  서   구            208064
8    강화군             32202
9    옹진군             11746

In [187]:
# 외 국 인(여) 컬럼값이 4000 이상 
df_inchon[df_inchon['외 국 인(여)'] > 4000]

    군  구  주 민 등 록 인 구(남)  주 민 등 록 인 구(여)  주 민 등 록 인 구(세대수)  외 국 인(남)  외 국 인(여)
2  남   구          211021          207512            183418      4281      4235
3    연수구          169121          170806            126408      4386      4862
5    부평구          262855          266867            213270      6602      6178

In [ ]:
# 외국인 컬럼 추가 => '외 국 인(남)'+ '외 국 인(여)'

In [188]:
df_inchon['외국인'] = df_inchon['외 국 인(여)']+df_inchon['외 국 인(남)']

In [189]:
df_inchon

,군 구,주 민 등 록 인 구(남),주 민 등 록 인 구(여),주 민 등 록 인 구(세대수),외 국 인(남),외 국 인(여),외국인
0,중 구,62202,57227,55952,2006,1886,3892
1,동 구,33875,33312,29153,518,391,909
2,남 구,211021,207512,183418,4281,4235,8516
3,연수구,169121,170806,126408,4386,4862,9248
4,남동구,268451,270525,217621,8370,3824,12194
5,부평구,262855,266867,213270,6602,6178,12780
6,계양구,157731,158190,124349,1396,1775,3171
7,서 구,269966,264198,208064,8331,3793,12124
8,강화군,34498,34274,32202,495,278,773
9,옹진군,12010,9200,11746,130,54,184

In [190]:
# '외 국 인(남)'+ '외 국 인(여)' 컬럼 삭제 
df_inchon.drop(['외 국 인(남)','외 국 인(여)'], inplace=True, axis=1)

In [191]:
df_inchon

    군  구  주 민 등 록 인 구(남)  주 민 등 록 인 구(여)  주 민 등 록 인 구(세대수)    외국인
0  중   구           62202           57227             55952   3892
1  동   구           33875           33312             29153    909
2  남   구          211021          207512            183418   8516
3    연수구          169121          170806            126408   9248
4    남동구          268451          270525            217621  12194
5    부평구          262855          266867            213270  12780
6    계양구          157731          158190            124349   3171
7  서   구          269966          264198            208064  12124
8    강화군           34498           34274             32202    773
9    옹진군           12010            9200             11746    184

In [192]:
# 통계 정보 확인 
df_inchon.describe()

       주 민 등 록 인 구(남)  주 민 등 록 인 구(여)  주 민 등 록 인 구(세대수)          외국인
count       10.000000       10.000000         10.000000     10.00000
mean    148173.000000   147211.100000     120218.300000   6379.10000
std     104801.268158   105617.357956      82897.864944   5129.35533
min      12010.000000     9200.000000      11746.000000    184.00000
25%      41424.000000    40012.250000      38139.500000   1474.50000
50%     163426.000000   164498.000000     125378.500000   6204.00000
75%     249896.500000   250026.500000     201902.500000  11405.00000
max     269966.000000   270525.000000     217621.000000  12780.00000

In [195]:
# 외국인 컬럼의 분위수 정보 출력
df_inchon.describe().loc['25%':'75%', '외국인']

25%     1474.5
50%     6204.0
75%    11405.0
Name: 외국인, dtype: float64

In [197]:
df_inchon.describe().loc['25%':'75%', ['외국인']]

         외국인
25%   1474.5
50%   6204.0
75%  11405.0

#####  tsv 파일 => 데이타프레임 

```
tab seperate value 
sep='\t' 로 지정 
pd.read_csv('data/gapminder.tsv', encoding='cp949', sep='\t')
```

In [201]:
# ls data

In [200]:
df_gap = pd.read_csv('data/gapminder.tsv', encoding='cp949', sep='\t')

In [202]:
df_gap.sample(5)

       country continent  year  lifeExp       pop      gdpPercap
852     Kuwait      Asia  1952   55.565    160000  108382.352900
1683    Zambia    Africa  1967   47.768   3900000    1777.077318
779      Italy    Europe  2007   80.546  58147733   28569.719700
216   Cambodia      Asia  1952   39.417   4693836     368.469286
529     France    Europe  1957   68.930  44310863    8662.834898

In [203]:
df_gap['year']

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [204]:
df_gap.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [205]:
df_gap.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [206]:
df_gap.shape

(1704, 6)

In [ ]:
# 2007 년도 데이타만 출력

In [208]:
df_gap[df_gap['year'] == 2007]

                 country continent  year  lifeExp       pop     gdpPercap
11           Afghanistan      Asia  2007   43.828  31889923    974.580338
23               Albania    Europe  2007   76.423   3600523   5937.029526
35               Algeria    Africa  2007   72.301  33333216   6223.367465
47                Angola    Africa  2007   42.731  12420476   4797.231267
59             Argentina  Americas  2007   75.320  40301927  12779.379640
...                  ...       ...   ...      ...       ...           ...
1655             Vietnam      Asia  2007   74.249  85262356   2441.576404
1667  West Bank and Gaza      Asia  2007   73.422   4018332   3025.349798
1679         Yemen, Rep.      Asia  2007   62.698  22211743   2280.769906
1691              Zambia    Africa  2007   42.384  11746035   1271.211593
1703            Zimbabwe    Africa  2007   43.487  12311143    469.709298

[142 rows x 6 columns]

In [210]:
# 컬럼은 어떤 값으로 구성되어 있을까?
# 데이타프레임[컬럼명].unique()
df_gap['continent'].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [211]:
# 'Europe' 값으로 구성된 데이타프레임 생성 => df_eu
df_eu = df_gap[df_gap['continent'] == 'Europe']
df_eu

             country continent  year  lifeExp       pop     gdpPercap
12           Albania    Europe  1952   55.230   1282697   1601.056136
13           Albania    Europe  1957   59.280   1476505   1942.284244
14           Albania    Europe  1962   64.820   1728137   2312.888958
15           Albania    Europe  1967   66.220   1984060   2760.196931
16           Albania    Europe  1972   67.690   2263554   3313.422188
...              ...       ...   ...      ...       ...           ...
1603  United Kingdom    Europe  1987   75.007  56981620  21664.787670
1604  United Kingdom    Europe  1992   76.420  57866349  22705.092540
1605  United Kingdom    Europe  1997   77.218  58808266  26074.531360
1606  United Kingdom    Europe  2002   78.471  59912431  29478.999190
1607  United Kingdom    Europe  2007   79.425  60776238  33203.261280

[360 rows x 6 columns]

In [212]:
# df_eu 데이타프레임의 lifeExp 컬럼의 최대값은?
df_eu['lifeExp'].max()

81.757

lifeExp  컬럼값이 81.757 데이타는?

In [213]:
df_eu[df_eu['lifeExp'] == df_eu['lifeExp'].max()]

     country continent  year  lifeExp     pop    gdpPercap
695  Iceland    Europe  2007   81.757  301931  36180.78919

## 퀴즈

1) gapminder.tsv 파일을 이용하여 데이타프레임을 생성하고 
   'Asia' 만 행 추출하여 새로운 데이타프레임으로 저장하여라
2) 1번에서 생성한 데이타프레임의 총 행수는?
3) 1번에서 생성한 데이타프레임에서 year 년도가 (1970~1979)년도의 행만 출력하여라
4) 3번의 결과행을 2번의 데이타프레임에서 제외한후 출력하여라
5) 1번의 데이타프레임에서 gdpPercap 컬럼값이 가장 높은 나라의 정보를 출력하여라 
6) 1번의 데이타프레임에서 lifeExp	 컬럼값이 가장 높은 나라는?
7) 1번의 데이타프레임에서 pop 컬럼의 평균 이상인 나라의 총수는?